Workshop-6/app/Controllers/studentController.php

    public function index()
    {
        $model = new StudentModel();
        $data['students'] = $model->findAll();
---
SELECT *
FROM `students`

    public function create()
    {
        $model = new CarrerModel();
        $data['carrers'] = $model->findAll();
---
SELECT *
FROM `carrers`

    public function store()
    {
        $model = new StudentModel();

        $model->save([
            'first_name'  => $this->request->getPost('first_name'),
            'last_name'  => $this->request->getPost('last_name'),
            'id_carrer' => $this->request->getPost('id_carrer'),
        ]);
---
INSERT INTO `students` (`first_name`, `last_name`, `id_carrer`) VALUES ('Lucas', 'Perez', '1')

    public function edit($id)
    {
        $studentModel = new StudentModel();
        $carrerModel = new CarrerModel();
        $data['student'] = $studentModel->find($id);
        $data['carrers'] = $carrerModel->findAll();
---
SELECT *
FROM `carrers`